# Adding New Columns

In the second chapter we will learn how to add new columns to the tables based on a set of functions. This is similar to the Functions that are available in Excel with _=FUNC(A1)_

We will start with loading a csv file that is hosted in data.world on the "Median Value Per Sq ft per zip code in the US"

In [68]:
import pandas as pd

In [69]:
df = pd.read_csv('https://query.data.world/s/xrfy7fb7oq55gpzh6bvs6jtonv32lk')

In [70]:
df.head()

,RegionID,RegionName,City,State,Metro,CountyName,SizeRank,1996-04,1996-05,1996-06,...,2016-12,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06,2017-07,2017-08,2017-09
0,61639,10025,New York,NY,New York,New York,1,NaN,NaN,NaN,...,1306.0,1290,1277,1272,1271,1277,1281,1279,1274,1270
1,84654,60657,Chicago,IL,Chicago,Cook,2,134.0,134.0,133.0,...,291.0,294,296,295,293,294,294,294,294,295
2,61637,10023,New York,NY,New York,New York,3,NaN,NaN,NaN,...,1602.0,1597,1580,1567,1569,1570,1560,1543,1529,1521
3,84616,60614,Chicago,IL,Chicago,Cook,4,149.0,150.0,150.0,...,330.0,333,333,331,330,330,329,328,329,329
4,93144,79936,El Paso,TX,El Paso,El Paso,5,50.0,51.0,50.0,...,81.0,81,81,81,81,81,82,82,82,82

## Constant Value

The simplest way to add a column is to put a constant value. Since we know that this data is only for USA we can add a column with the value _USA_ to a new column called _country_. We will be able to later merge this table with data from other countries and then this new column will be useful. 

For setting a value in a column we will use the [assign](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.assign.html) function of Pandas.

In [71]:
(
    df
    .assign(country="USA")
)

,RegionID,RegionName,City,State,Metro,CountyName,SizeRank,1996-04,1996-05,1996-06,...,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06,2017-07,2017-08,2017-09,country
0,61639,10025,New York,NY,New York,New York,1,NaN,NaN,NaN,...,1290,1277,1272,1271,1277,1281,1279,1274,1270,USA
1,84654,60657,Chicago,IL,Chicago,Cook,2,134.0,134.0,133.0,...,294,296,295,293,294,294,294,294,295,USA
2,61637,10023,New York,NY,New York,New York,3,NaN,NaN,NaN,...,1597,1580,1567,1569,1570,1560,1543,1529,1521,USA
3,84616,60614,Chicago,IL,Chicago,Cook,4,149.0,150.0,150.0,...,333,333,331,330,330,329,328,329,329,USA
4,93144,79936,El Paso,TX,El Paso,El Paso,5,50.0,51.0,50.0,...,81,81,81,81,81,82,82,82,82,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14750,73940,36564,Fairhope,AL,Daphne,Baldwin,14751,NaN,NaN,NaN,...,230,238,243,245,244,245,246,244,240,USA
14751,59107,3293,Woodstock,NH,Claremont,Grafton,14752,58.0,59.0,61.0,...,129,129,128,129,130,130,130,130,131,USA
14752,82396,55713,Buhl,MN,Duluth,Saint Louis,14753,NaN,NaN,NaN,...,72,73,74,74,73,73,74,77,79,USA
14753,66881,21405,Annapolis,MD,Baltimore,Anne Arundel,14754,146.0,149.0,151.0,...,470,462,457,457,455,454,455,458,460,USA
14754,94815,85220,Apache Junction,AZ,Phoenix,Pinal,14755,NaN,NaN,NaN,...,117,119,119,119,120,121,122,124,124,USA

## Using Lambda

Lambda is a bit confusing at first glance, however, it is used to define a the function that we want to apply on a each row or columns of the table. For example, let's define a new column that is checking if the state is one of ['NY','NJ']

In [72]:
(
    df
    .assign(is_NY_or_NJ=lambda x : x.State.isin(['NY','NJ']))
)

,RegionID,RegionName,City,State,Metro,CountyName,SizeRank,1996-04,1996-05,1996-06,...,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06,2017-07,2017-08,2017-09,is_NY_or_NJ
0,61639,10025,New York,NY,New York,New York,1,NaN,NaN,NaN,...,1290,1277,1272,1271,1277,1281,1279,1274,1270,True
1,84654,60657,Chicago,IL,Chicago,Cook,2,134.0,134.0,133.0,...,294,296,295,293,294,294,294,294,295,False
2,61637,10023,New York,NY,New York,New York,3,NaN,NaN,NaN,...,1597,1580,1567,1569,1570,1560,1543,1529,1521,True
3,84616,60614,Chicago,IL,Chicago,Cook,4,149.0,150.0,150.0,...,333,333,331,330,330,329,328,329,329,False
4,93144,79936,El Paso,TX,El Paso,El Paso,5,50.0,51.0,50.0,...,81,81,81,81,81,82,82,82,82,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14750,73940,36564,Fairhope,AL,Daphne,Baldwin,14751,NaN,NaN,NaN,...,230,238,243,245,244,245,246,244,240,False
14751,59107,3293,Woodstock,NH,Claremont,Grafton,14752,58.0,59.0,61.0,...,129,129,128,129,130,130,130,130,131,False
14752,82396,55713,Buhl,MN,Duluth,Saint Louis,14753,NaN,NaN,NaN,...,72,73,74,74,73,73,74,77,79,False
14753,66881,21405,Annapolis,MD,Baltimore,Anne Arundel,14754,146.0,149.0,151.0,...,470,462,457,457,455,454,455,458,460,False
14754,94815,85220,Apache Junction,AZ,Phoenix,Pinal,14755,NaN,NaN,NaN,...,117,119,119,119,120,121,122,124,124,False

In [73]:
red_blue_states_wikipedia_entry = 'https://en.wikipedia.org/wiki/Red_states_and_blue_states'
wikipedia_page_tables = pd.read_html(red_blue_states_wikipedia_entry)

As we saw in the loading data from web site, the list includes multiple tables. After some scrolling we can see the table that we want is the one with index 11

In [74]:
red_blue_states = wikipedia_page_tables[11]
red_blue_states.head()

,Year,1972,1976,1980,1984,1988,1992,1996,2000,2004,2008,2012,2016
0,Democratic candidate,George McGovern,Jimmy Carter,Jimmy Carter,Walter Mondale,Michael Dukakis,Bill Clinton,Bill Clinton,Al Gore,John Kerry,Barack Obama,Barack Obama,Hillary Clinton
1,Republican candidate,Richard Nixon,Gerald Ford,Ronald Reagan,Ronald Reagan,George H. W. Bush,George H. W. Bush,Bob Dole,George W. Bush,George W. Bush,John McCain,Mitt Romney,Donald Trump
2,National popular vote,Nixon,Carter,Reagan,Reagan,Bush,B. Clinton,Clinton,Gore,Bush,Obama,Obama,H. Clinton
3,Alabama,Nixon,Carter,Reagan,Reagan,Bush,Bush,Dole,Bush,Bush,McCain,Romney,Trump
4,Alaska,Nixon,Ford,Reagan,Reagan,Bush,Bush,Dole,Bush,Bush,McCain,Romney,Trump

In [75]:
red_candidate = 'Trump'

In [76]:
red_states = (
    red_blue_states
    .rename(columns={'2016':'Last'})
    .reset_index()
    .query("Last == @red_candidate")
    .iloc[:,1]
)
red_states

3            Alabama
4             Alaska
5            Arizona
6           Arkansas
12           Florida
13           Georgia
15             Idaho
17           Indiana
18              Iowa
19            Kansas
20          Kentucky
21         Louisiana
27          Michigan
29       Mississippi
30          Missouri
31           Montana
39    North Carolina
40      North Dakota
41              Ohio
42          Oklahoma
44      Pennsylvania
46    South Carolina
47      South Dakota
48         Tennessee
49             Texas
50              Utah
54     West Virginia
55         Wisconsin
56           Wyoming
Name: Year, dtype: object

In [77]:
us_state_abbrev = {
    'Alabama': 'AL',
    'Alaska': 'AK',
    'American Samoa': 'AS',
    'Arizona': 'AZ',
    'Arkansas': 'AR',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'Delaware': 'DE',
    'District of Columbia': 'DC',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Guam': 'GU',
    'Hawaii': 'HI',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Iowa': 'IA',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Maine': 'ME',
    'Maryland': 'MD',
    'Massachusetts': 'MA',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Mississippi': 'MS',
    'Missouri': 'MO',
    'Montana': 'MT',
    'Nebraska': 'NE',
    'Nevada': 'NV',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'New York': 'NY',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Northern Mariana Islands':'MP',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Puerto Rico': 'PR',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Vermont': 'VT',
    'Virgin Islands': 'VI',
    'Virginia': 'VA',
    'Washington': 'WA',
    'West Virginia': 'WV',
    'Wisconsin': 'WI',
    'Wyoming': 'WY'
}
us_state_abbrev_df = (
    pd
    .DataFrame
    .from_dict(us_state_abbrev, 
                orient='index',
                columns=['Abbreviation'])
)

In [86]:
red_state_abbrev = (
    us_state_abbrev_df
    .loc[red_states]
    .loc[:,'Abbreviation']
)
red_state_abbrev

Alabama           AL
Alaska            AK
Arizona           AZ
Arkansas          AR
Florida           FL
Georgia           GA
Idaho             ID
Indiana           IN
Iowa              IA
Kansas            KS
Kentucky          KY
Louisiana         LA
Michigan          MI
Mississippi       MS
Missouri          MO
Montana           MT
North Carolina    NC
North Dakota      ND
Ohio              OH
Oklahoma          OK
Pennsylvania      PA
South Carolina    SC
South Dakota      SD
Tennessee         TN
Texas             TX
Utah              UT
West Virginia     WV
Wisconsin         WI
Wyoming           WY
Name: Abbreviation, dtype: object

In [89]:
(
    df
    .assign(is_red=lambda x : x.State.isin(red_state_abbrev))
    .groupby('is_red')['2017-09']
    .mean()
)

is_red
False    226.389382
True     105.153760
Name: 2017-09, dtype: float64